{
    "access_right": "open",
    "creators": [
        {
            "affiliation": "Department of Biology/Chemistry and Center for Cellular Nanoanalytics, University Osnabrück, Germany",
            "name": "Abdrabbou, Mohamed M.",
            "orcid": "0000-0003-2778-7483"
        }, {
            "affiliation": "Center for Molecular Medicine Cologne and CECAD Research Center, University of Cologne, Cologne, Germany",
            "name": "Babaki, Mehrnaz",
            "orcid": "0000-0003-3099-618X"
        }, {
            "affiliation": "Center for Advanced Imaging, Heinrich-Heine-Universität Düsseldorf, Düsseldorf, Germany",
            "name": "Boissonnet, Tom",
            "orcid": "0000-0002-3328-9467"
        }, {
            "affiliation": "Single-cell Open Lab, German Cancer Research Center (DKFZ), Heidelberg, Germany",
            "name": "Bortolomeazzi, Michele",
            "orcid": "0000-0001-5805-5774"
        }, {
            "affiliation": "Regional Computer Center (RRZK), University of Cologne, Cologne, Germany",
            "name": "Dahms, Eik",
            "orcid": "0000-0002-7452-1146"
        }, {
            "affiliation": "Center for Advanced Imaging, Heinrich-Heine-Universität Düsseldorf, Düsseldorf, Germany",
            "name": "Fuchs, Vanessa A. F.",
            "orcid": "0000-0002-4101-6987"
        }, {
            "affiliation": "Regional Computing Centre (RRZK/ITCC), University of Cologne, Cologne, Germany",
            "name": "Hoevels, Moritz"
        }, {
            "affiliation": "Cologne Excellence Cluster on Cellular Stress Responses in Aging-Associated Diseases (CECAD), University of Cologne, Cologne, Germany",
            "name": "Kandpal, Niraj",
            "orcid": "0009-0007-5101-4786"
        }, {
            "affiliation": "Cologne Excellence Cluster on Cellular Stress Responses in Aging-Associated Diseases (CECAD), Cologne, Germany",
            "name": "Möhl, Christoph",
            "orcid": "0000-0002-0829-5101"
        }, {
            "affiliation": "German BioImaging—Society for Microscopy and Image Analysis e.V., Constance, Germany",
            "name": "Moore, Joshua A.",
            "orcid": "0000-0003-4028-811X"
        }, {
            "affiliation": "Cologne Excellence Cluster on Cellular Stress Responses in Aging-Associated Diseases (CECAD), Cologne, Germany",
            "name": "Schauss, Astrid",
            "orcid": "0000-0002-6658-2192"
        }, {
            "affiliation": "Data Science and Management & Cluster of Excellence on Plant Sciences (CEPLAS), University of Cologne, Cologne, Germany",
            "name": "Schrader, Andrea",
            "orcid": "0000-0002-3879-7057"
        }, {
            "affiliation": "Leibniz Institute for Neurobiology (LIN), Magdeburg, Germany",
            "name": "Stöter, Torsten",
        }, {
            "affiliation": "Institute of Neuroscience and Medicine (INM-1), Forschungszentrum Jülich, Germany",
            "name": "Thönnißen, Julia",
            "orcid": "0000-0002-5467-871X"
        }, {
            "affiliation": "Regional Computer Center (RRZK), University of Cologne, Cologne, Germany",
            "name": "Valencia-Schneider, Mónica E.",
            "orcid": "0000-0003-3430-2683"
        }, {
            "affiliation": "Computational Systems Biology, University of Kaiserslautern-Landau, Kaiserslautern, Germany",
            "name": "Weil, H. Lukas",
            "orcid": "0000-0003-1945-6342"
        }, {
            "affiliation": "Muenster Imaging Network, University of Muenster, Muenster, Germany",
            "name": "Wendt, Jens",
            "orcid": "0009-0002-1826-7099"
        }, {
            "affiliation": "Cologne Excellence Cluster on Cellular Stress Responses in Aging-Associated Diseases (CECAD), Cologne, Germany",
            "name": "Zentis, Peter",
            "orcid": "0000-0002-6999-132X"
        }
    ],
    "description": "This is the repository for documentation during the first NFDI4Bioimage - TA3-Hackathon - UoC-2023 (in short: Cologne Hackathon). Potential topics were identified in a preparatory meeting and covered with introductory talks. In a joint discussion and workflow as well as roadmap session, graphical workflows were created and tasks were defined. Eventually intensive work on the topics 'Interoperability', 'REMBI / Mapping', 'Neuroglancer (OMERO / zarr)' was conducted in groups and final reports summarized the outcome of this initial hackathon which also bridged from NFDI4Bioimage to DataPLANT on the topic of OMERO-ARC interoperability. From the beginning, there was a focus on documentation and on including use cases. The interoperability and REMBI topic served as preparatory work for a project at the 2nd de.NBI BioHackathon in Bielefeld: 'Towards OMERO and ARC interoperability for RDM-compliant bio-image data'. For the OMERO-ARC topic, we are thankful for the collaboration with DataPLANT (funded by the German Research Foundation (DFG) within the framework of the NFDI - project numbers: 442077441). We thank Heinrich Lukas Weil (DataPLANT) for participating and contributing as a guest, also providing the introductory talk on ARC. Furthermore, we acknowledge the contribution of Timo Mühlhaus in discussions during planning for the OMERO-ARC project and of Kevin Schneider in preparatory meetings on the OMERO-ARC project (both: DataPLANT). Funding allowing this event including enabling for organization, participation and finalizing this repository including the Zenodo submission: NFDI4Bioimage, funded by the German Research Foundation (DFG) within the framework of the NFDI-project numbers: 501864659; CEPLAS, Cluster of Excellence on Plant Sciences, funded by the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) under Germany's Excellence Strategy, EXC-2048/1'; CECAD, Cologne Excellence Cluster on Cellular Stress Responses in Aging-Associated Diseases, funded by the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) under Germany's Excellence Strategy - EXC 2030 - 390661388; CRC TRR341, Funded by the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) - Project-ID 456082119.",
    "keywords": [
        "OMERO",
        "ARC",
        "Neuroglancer",
        "zarr",
        "REMBI",
        "metadata",
        "use cases",
        "multimodal data",
        "hackathon",
        "NFDI4Bioimage",
        "DataPLANT",
        "CECAD",
        "CEPLAS",
        "CRC-TRR341"
    ],
    "license": "CC-BY-4.0",
    "notes": "If you use content of this repository, please cite it using these metadata. Authors are in alphabetical order!",
    "publication_date": "2024-01-30",
    "references": [
        "Allan, C., Burel, J.-M., Moore, J. A., Blackburn, C., Linkert, M., Loynton, S., MacDonald, D., Moore, W. J., Neves, C., Patterson, A., Porter, M., Tarkowska, A., Loranger, B., Avondo, J., Lagerstedt, I., Lianas, L., Leo, S., Hands, K., Hay, R. T., Patwardhan, A., Best, C., Kleywegt, G. J., Zanetti, G. & Swedlow, J. R. (2012). OMERO: flexible, model-driven data management for experimental biology. Nature Methods 9, 245-253. Published: 28 February 2012, https://doi.org/10.1038/nmeth.1896",
        "Anders, I., Bianchi, C., Broder, D., Hellström, M., Islam, S., Jejkal, T., Lannom, L., Peters-von Gehlen, K., Quick, R., Schlemmer, A., Schwardmann, U., Soiland-Reyes, S., Strawn, G., van Uytvanck, D., Weiland, C., Wittenburg, P. & Zwölf, C. (2023). FDO Forum FDO Requirement Specifications. Zenodo. https://doi.org/10.5281/zenodo.7782262",
        "Baker, S. and tree contributors. 'tree v2.1.1' (2023). [Online]. Available: https://oldmanprogrammer.net/source.php?dir=projects/tree. Accessed 07. Dec. 2023",
        "Burel, J.-M., Moore, J. A., Moore, W. J. (2023). ome/omero-web-zarr 0.1.1 (GitHub repository). Available: https://github.com/ome/omero-web-zarr",
        "Coderefinery contributors, 'github-without-command-line/doi' 2020 [Online]. Available: https://coderefinery.github.io/github-without-command-line/doi/. Accessed 03. Jan. 2024",
        "Crusoe, M. R., Abeln, S., Iosup, A., Amstutz, P., Chilton, J., Tijanić, N., Ménager, H., Soiland-Reyes, S., Gavrilović, B., Goble, C. & The CWL Community. (2022). Methods Included: Standardizing Computational Reuse and Portability with the Common Workflow Language. Commun. ACM 65, 6. 54-63, https://doi.org/10.1145/3486897",
        "DataPLANT community. (2023). nfdi4plants/ARC-specification: 1.2. Zenodo. https://doi.org/10.5281/zenodo.10091038",
        "Dumschott, K., Dörpholz, H., Laporte, M.-A., Brilhaus, D., Schrader, A. Usadel, B., Neumann, S., Arnaud, E. & Kranz, A. (2023). Ontologies for increasing the FAIRness of plant research data. Frontiers in Plant Science 14:1279694. Published: 30 November 2023, https://doi.org/10.3389/fpls.2023.1279694",
        "Fedorov A., Beichel R., Kalpathy-Cramer J., Finet J., Fillion-Robin J-C., Pujol S., Bauer C., Jennings D., Fennessy F. M., Sonka M., Buatti J., Aylward S. R., Miller J. V., Pieper S., Kikinis R. (2012). 3D Slicer as an Image Computing Platform for the Quantitative Imaging Network. Magnetic Resonance Imaging 30(9):1323-41, https://doi.org/10.1016/j.mri.2012.05.001",
        "Frey, K., & Swate contributors. (2022) Swate v0.6.2 (GitHub repository). Available: https://github.com/nfdi4plants/Swate",
        "Google Connectomics Team. (2023). Neuroglancer v2.37 (GitHub repository). Available: https://github.com/google/neuroglancer/",
        "Gorgolewski, K., Auer, T., Calhoun, V., Craddock, R. C., Das, S., Duff, E. P., Flandin, G., Ghosh, S. S., Glatard, T., Halchenko, Y. O., Handwerker, D. A., Hanke, M., Keator, D., Li, X., Michael, Z., Maumet, C., Nichols, B. N., Nichols, T. E., Pellman, J., Poline, J.-B., Rokem, A., Schaefer, G., Sochat, V., Triplett, W., Turner, J. A., Varoquaux, G., Poldrack, R. A. The brain imaging data structure, a format for organizing and describing outputs of neuroimaging experiments. Scientific Data 3, 160044 (2016). https://doi.org/10.1038/sdata.2016.44",
        "Linkert, M., Rueden, C. T., Allan, C., Burel, J.-M., Moore, W. J., Patterson, A., Loranger, B., Moore, J. A., Neves, C., MacDonald, D., Tarkowska, A., Sticco, C., Hill, E:, Rossner, M., Eliceiri, K. W., & Swedlow J. R. (2010). Metadata matters: access to image data in the real world. The Journal of Cell Biology 189(5), 777-782. https://doi.org/10.1083/jcb.201004104",
        "Maitin-Shepard, J., Baden, A., Silversmith, W., Perlman, E., Collman, F., Blakely, T., Funke, J., Jordan, C., Falk, B., Kemnitz, N., tingzhao, Roat, C., Castro, M., Jagannathan, S., moenigin, Clements, J., Hoag, A., Katz, B., Parsons, D., Wu, J., Kamentsky, L., Chervakov, P., Hubbard, P., Berg, S., Hoffer, J., Halageri, A., Machacek, C., Mader, K., Roeder, L., Li, P. H. (2021). google/neuroglancer: (v2.23). Zenodo. https://doi.org/10.5281/zenodo.5573294",
        "Martins Ratamero, E., Burel, J.-M., Sobolewski, P. & Moore, W. J. (2023). ome/omero-cli-transfer: 0.8.0 - new `--simple` option in `pack` (0.8.0). Zenodo. https://doi.org/10.5281/zenodo.8383499",
        "Möhl, C. (2023). OMERO-ARC Plugin (GitHub repository). Available: https://github.com/cmohl2013/omero-arc",
        "Moore, J. A., Basurto-Lozada, D., Besson, S., Bogovic, J., Bragantini, J., Brown, E. M., Burel, J.-M., Casas Moreno, X., de Medeiros, G., Diel, E. E., Gault, D., Ghosh, S. S., Gold, I., Halchenko, Y. O., Hartley, M., Horsfall, D., Keller, M. S., Kittisopikul, M., Kovacs, G., Küpcü Yoldaş, A., Kyoda, K., le Tournoulx de la Villegeorges, A., Li, T., Liberali, P., Lindner, D., Linkert, M., Lüthi, J., Maitin-Shepard, J., Manz, T., Marconato, L., McCormick, M., Lange, M., Mohamed, K., Moore, W., Norlin, N., Ouyang, W., Özdemir, B., Palla, G., Pape, C., Pelkmans, L., Pietzsch, T., Preibisch, S., Prete, M., Rzepka, N., Samee, S., Schaub, N., Sidky, H., Solak, A. C., Stirling, D. R., Striebel, J., Tischer, C., Toloudis, D., Virshup, I., Walczysko, P., Watson, A. M., Weisbart, E., Wong, F., Yamauchi, K. A., Bayraktar, O., Cimini, B. A., Gehlenborg, N., Haniffa, M., Hotaling, N., Onami, S., Royer, L. A., Saalfeld, S., Stegle, O., Theis, F. J. & Swedlow, J. R. (2023) OME-Zarr: a cloud-optimized bioimaging file format with international community support. Histochemistry and Cell Biology. 160, 223-251. https://doi.org/10.1007/s00418-023-02209-1",
        "RDM4mic. (2023). I3D:bio's OMERO Training Videos 2023. https://www.youtube.com/playlist?list=PL2k-L-zWPoR7SHjG1HhDIwLZj0MB_stlU",
        "Sansone, S.-A., Rocca-Serra, P., Gonzalez-Beltran, A., Johnson, D., & ISA Community. (2016). ISA Model and Serialization Specifications 1.0. Zenodo. https://doi.org/10.5281/zenodo.163640",
        "Sarkans, U., Chiu, W., Collinson, L., Darrow, M. C., Ellenberg, J., Grunwald, D., Hériché, J.-K., Iudin, A., Martins, G.G., Meehan, T., Narayan, K., Patwardhan, A., Russell, M. R. G., Saibil, H.R., Strambio-De-Castillia, C., Swedlow, J.R., Tischer, C., Uhlmann, V., Verkade, P., Barlow, M., Bayraktar, O., Birney, E., Catavitello, C., Cawthorne, C., Wagner-Conrad, S., Duke, E., Paul-Gilloteaux, P., Gustin, E., Harkiolaki, M., Kankaanpää, P., Lemberger, T., McEntyre, J., Moore, J. A., Nicholls, A. W., Onami, S., Parkinson, H., Parsons, M. Romanchikova, M., Sofroniew, N., Swoger, J., Utz, N., Voortman, L.M., Wong, F., Zhang, P., Kleywegt, G.j. & Brazma, A. (2021). REMBI: Recommended Metadata for Biological Images-enabling reuse of microscopy data in biology. Nature Methods 18. 1418-1422. https://doi.org/10.1038/s41592-021-01166-8",
        "Schmidt, C., Bortolomeazzi, M., Boissonnet, T., Fortmann-Grote, C., Dohle, J., Zentis, P., Kandpal, N., Kunis, S., Zobel, T., Weidtkamp-Peters, S., & Ferrando-May, E. (2023). I3D:bio's OMERO training material: Re-usable, adjustable, multi-purpose slides for local user training. Zenodo. https://doi.org/10.5281/zenodo.8323588",
        "Schrader, A. (2024). andreaschrader/doi-exercise (1.5.1). Zenodo. https://doi.org/10.5281/zenodo.10475430",
        "Sefton, P., Ó Carragáin, E., Soiland-Reyes, S., Corcho, O., Garijo, D., Palma, R., Coppens, F., Goble, C., Fernández, J. M., Chard, K., Gomez-Perez, J. M., Crusoe, M. R., Eguinoa, I., Juty, N., Holmes, K., Clark, J. A., Capella-Gutierrez, S., Gray, A. J. G., Owen, S., Williams, A. R., Tartari, G., Bacall, F., Thelen, T., Ménager, H., Rodríguez-Navas, L., Walk, P., Whitehead, B., Wilkinson, M., Groth, P., Bremer, E., Castro, L. J., Sebby, K., Kanitz, A., Trisovic, A., Kennedy, G., Graves, M., Koehorst, J., Leo, S., Portier, M., Brack, P., Ojsteršek, M., Droesbeke, B., Niu, C., Kosuke, T., Tomasz, M., La Rosa, M., Decruw, C., Czerniak, A., Jay, J., Serra, S., Siebes, R., de Witt, S., El Damaty, S., Lowe, D., Li, X., Gundersen, S. & Radifar, M. (2023). RO-Crate Metadata Specification 1.1.3 (1.1.3). Zenodo. https://doi.org/10.5281/zenodo.7867028",
        "Spaaks, J. H., Klaver, T., Verhoeven, S., Druskat, S., & Leoncio Netto, W. (2021). cffconvert (2.0.0). Zenodo. https://doi.org/10.5281/zenodo.5521767. Accessed 03. Jan. 2024",
        "Weil, H. L. & ARC Commander contributors. (2023). ARC Commander (GitHub repository). Available: https://github.com/nfdi4plants/arcCommander",
        "Wilkinson, M., Dumontier, M., Aalbersberg, I., Appleton, G., Axton, M., Baak, A., Blomberg, N., Boiten, J.-W., da Silva Santos, L. B., Bourne, P. E., Bouwman, J., Brookes, A. J., Clark, T., Crosas, M., Dillo, I., Dumon, O., Edmunds, S., Evelo,, C. T., Finkers, R., Gonzalez-Beltran, A., Gray, A. J. G., Groth, P., Goble, C., Grethe, J. S., Heringa, J., 't Hoen, P. A. C., Hooft, R., Kuhn, T., Kok, R., Kok, J., Lusher, S. J., Martone, M. E., Mons, A., Packer, A. L., Persson, B., Rocca-Serra, P., Roos, M., van Schaik, R., Sansone, S.-A., Schultes, E., Sengstag, T., Slater, T., Strawn, G., Swertz, M. A., Thompson, M, van der Lei, J., van Mulligen, E., Velterop, J., Waagmeester, A., Wittenburg, P., Wolstencroft, K., Zhao, J. & Mons, B. (2016) The FAIR Guiding Principles for scientific data management and stewardship. Scientific Data 3, 160018. https://doi.org/10.1038/sdata.2016.18",
        "Xiang Z, Mungall C, Ruttenberg A, He Y. (2011). Ontobee: A Linked Data Server and Browser for Ontology Terms. Proceedings of the 2nd International Conference on Biomedical Ontologies (ICBO), July 28-30, 2011, Buffalo, NY, USA. Pages 279-281. http://ceur-ws.org/Vol-833/paper48.pdf. Accessed 2023."
    ],
    "resource_type": "other",
    "title": "NFDI4Bioimage - TA3-Hackathon - UoC-2023 (Cologne-Hackathon-2023, GitHub repository)",
    "upload_type": "other",
    "version": "v0.9.2"
}
