{
    "access_right": "open",
    "communities": [
        {
            "identifier": "NFDI4BIOIMAGE"
        }
    ],
    "creators": [
        {
            "affiliation": "Several affiliations like CEPALS, CECAD, RRZK etc.",
            "name": "Hackathon Participants, Cologne",
            "orcid": "0000-0002-3879-7057"
        }
    ],
    "description": "Test description.",
    "keywords": [
        "OMERO",
        "ARC",
        "Neuroglancer",
        "zarr",
        "REMBI",
        "metadata",
        "use cases",
        "multimodal data",
        "hackathon",
        "NFDI4Bioimage",
        "DataPLANT",
        "CECAD",
        "CEPLAS",
        "CRC-TRR341"
    ],
    "license": "CC-BY-4.0",
    "notes": "If you use content of this repository, please cite it using these metadata. Authors are in alphabetical order!",
    "publication_date": "2024-01-31",
    "references": [
        "Allan, C., Burel, J.-M., Moore, J. A., Blackburn, C., Linkert, M., Loynton, S., MacDonald, D., Moore, W. J., Neves, C., Patterson, A., Porter, M., Tarkowska, A., Loranger, B., Avondo, J., Lagerstedt, I., Lianas, L., Leo, S., Hands, K., Hay, R. T., Patwardhan, A., Best, C., Kleywegt, G. J., Zanetti, G. & Swedlow, J. R. (2012). OMERO: flexible, model-driven data management for experimental biology. Nature Methods 9, 245-253. Published: 28 February 2012, https://doi.org/10.1038/nmeth.1896",
        "Anders, I., Bianchi, C., Broder, D., Hellström, M., Islam, S., Jejkal, T., Lannom, L., Peters-von Gehlen, K., Quick, R., Schlemmer, A., Schwardmann, U., Soiland-Reyes, S., Strawn, G., van Uytvanck, D., Weiland, C., Wittenburg, P. & Zwölf, C. (2023). FDO Forum FDO Requirement Specifications. Zenodo. https://doi.org/10.5281/zenodo.7782262",
        "Baker, S. and tree contributors. 'tree v2.1.1' (2023). [Online]. Available: https://oldmanprogrammer.net/source.php?dir=projects/tree. Accessed 07. Dec. 2023",
        "Burel, J.-M., Moore, J. A., Moore, W. J. (2023). ome/omero-web-zarr 0.1.1 (GitHub repository). Available: https://github.com/ome/omero-web-zarr",
        "Coderefinery contributors, 'github-without-command-line/doi' 2020 [Online]. Available: https://coderefinery.github.io/github-without-command-line/doi/. Accessed 03. Jan. 2024",
        "Crusoe, M. R., Abeln, S., Iosup, A., Amstutz, P., Chilton, J., Tijanić, N., Ménager, H., Soiland-Reyes, S., Gavrilović, B., Goble, C. & The CWL Community. (2022). Methods Included: Standardizing Computational Reuse and Portability with the Common Workflow Language. Commun. ACM 65, 6. 54-63, https://doi.org/10.1145/3486897",
        "DataPLANT community. (2023). nfdi4plants/ARC-specification: 1.2. Zenodo. https://doi.org/10.5281/zenodo.10091038",
        "Dumschott, K., Dörpholz, H., Laporte, M.-A., Brilhaus, D., Schrader, A. Usadel, B., Neumann, S., Arnaud, E. & Kranz, A. (2023). Ontologies for increasing the FAIRness of plant research data. Frontiers in Plant Science 14:1279694. Published: 30 November 2023, https://doi.org/10.3389/fpls.2023.1279694",
        "Fedorov A., Beichel R., Kalpathy-Cramer J., Finet J., Fillion-Robin J-C., Pujol S., Bauer C., Jennings D., Fennessy F. M., Sonka M., Buatti J., Aylward S. R., Miller J. V., Pieper S., Kikinis R. (2012). 3D Slicer as an Image Computing Platform for the Quantitative Imaging Network. Magnetic Resonance Imaging 30(9):1323-41, https://doi.org/10.1016/j.mri.2012.05.001",
        "Frey, K., & Swate contributors. (2022) Swate v0.6.2 (GitHub repository). Available: https://github.com/nfdi4plants/Swate",
        "Google Connectomics Team. (2023). Neuroglancer v2.37 (GitHub repository). Available: https://github.com/google/neuroglancer/",
        "Gorgolewski, K., Auer, T., Calhoun, V., Craddock, R. C., Das, S., Duff, E. P., Flandin, G., Ghosh, S. S., Glatard, T., Halchenko, Y. O., Handwerker, D. A., Hanke, M., Keator, D., Li, X., Michael, Z., Maumet, C., Nichols, B. N., Nichols, T. E., Pellman, J., Poline, J.-B., Rokem, A., Schaefer, G., Sochat, V., Triplett, W., Turner, J. A., Varoquaux, G., Poldrack, R. A. The brain imaging data structure, a format for organizing and describing outputs of neuroimaging experiments. Scientific Data 3, 160044 (2016). https://doi.org/10.1038/sdata.2016.44",
        "Linkert, M., Rueden, C. T., Allan, C., Burel, J.-M., Moore, W. J., Patterson, A., Loranger, B., Moore, J. A., Neves, C., MacDonald, D., Tarkowska, A., Sticco, C., Hill, E:, Rossner, M., Eliceiri, K. W., & Swedlow J. R. (2010). Metadata matters: access to image data in the real world. The Journal of Cell Biology 189(5), 777-782. https://doi.org/10.1083/jcb.201004104",
        "Maitin-Shepard, J., Baden, A., Silversmith, W., Perlman, E., Collman, F., Blakely, T., Funke, J., Jordan, C., Falk, B., Kemnitz, N., tingzhao, Roat, C., Castro, M., Jagannathan, S., moenigin, Clements, J., Hoag, A., Katz, B., Parsons, D., Wu, J., Kamentsky, L., Chervakov, P., Hubbard, P., Berg, S., Hoffer, J., Halageri, A., Machacek, C., Mader, K., Roeder, L., Li, P. H. (2021). google/neuroglancer: (v2.23). Zenodo. https://doi.org/10.5281/zenodo.5573294",
        "Martins Ratamero, E., Burel, J.-M., Sobolewski, P. & Moore, W. J. (2023). ome/omero-cli-transfer: 0.8.0 - new `--simple` option in `pack` (0.8.0). Zenodo. https://doi.org/10.5281/zenodo.8383499",
        "Möhl, C. (2023). OMERO-ARC Plugin (GitHub repository). Available: https://github.com/cmohl2013/omero-arc",
        "Moore, J. A., Basurto-Lozada, D., Besson, S., Bogovic, J., Bragantini, J., Brown, E. M., Burel, J.-M., Casas Moreno, X., de Medeiros, G., Diel, E. E., Gault, D., Ghosh, S. S., Gold, I., Halchenko, Y. O., Hartley, M., Horsfall, D., Keller, M. S., Kittisopikul, M., Kovacs, G., Küpcü Yoldaş, A., Kyoda, K., le Tournoulx de la Villegeorges, A., Li, T., Liberali, P., Lindner, D., Linkert, M., Lüthi, J., Maitin-Shepard, J., Manz, T., Marconato, L., McCormick, M., Lange, M., Mohamed, K., Moore, W., Norlin, N., Ouyang, W., Özdemir, B., Palla, G., Pape, C., Pelkmans, L., Pietzsch, T., Preibisch, S., Prete, M., Rzepka, N., Samee, S., Schaub, N., Sidky, H., Solak, A. C., Stirling, D. R., Striebel, J., Tischer, C., Toloudis, D., Virshup, I., Walczysko, P., Watson, A. M., Weisbart, E., Wong, F., Yamauchi, K. A., Bayraktar, O., Cimini, B. A., Gehlenborg, N., Haniffa, M., Hotaling, N., Onami, S., Royer, L. A., Saalfeld, S., Stegle, O., Theis, F. J. & Swedlow, J. R. (2023) OME-Zarr: a cloud-optimized bioimaging file format with international community support. Histochemistry and Cell Biology. 160, 223-251. https://doi.org/10.1007/s00418-023-02209-1",
        "RDM4mic. (2023). I3D:bio's OMERO Training Videos 2023. https://www.youtube.com/playlist?list=PL2k-L-zWPoR7SHjG1HhDIwLZj0MB_stlU",
        "Sansone, S.-A., Rocca-Serra, P., Gonzalez-Beltran, A., Johnson, D., & ISA Community. (2016). ISA Model and Serialization Specifications 1.0. Zenodo. https://doi.org/10.5281/zenodo.163640",
        "Sarkans, U., Chiu, W., Collinson, L., Darrow, M. C., Ellenberg, J., Grunwald, D., Hériché, J.-K., Iudin, A., Martins, G.G., Meehan, T., Narayan, K., Patwardhan, A., Russell, M. R. G., Saibil, H.R., Strambio-De-Castillia, C., Swedlow, J.R., Tischer, C., Uhlmann, V., Verkade, P., Barlow, M., Bayraktar, O., Birney, E., Catavitello, C., Cawthorne, C., Wagner-Conrad, S., Duke, E., Paul-Gilloteaux, P., Gustin, E., Harkiolaki, M., Kankaanpää, P., Lemberger, T., McEntyre, J., Moore, J. A., Nicholls, A. W., Onami, S., Parkinson, H., Parsons, M. Romanchikova, M., Sofroniew, N., Swoger, J., Utz, N., Voortman, L.M., Wong, F., Zhang, P., Kleywegt, G.j. & Brazma, A. (2021). REMBI: Recommended Metadata for Biological Images-enabling reuse of microscopy data in biology. Nature Methods 18. 1418-1422. https://doi.org/10.1038/s41592-021-01166-8",
        "Schmidt, C., Bortolomeazzi, M., Boissonnet, T., Fortmann-Grote, C., Dohle, J., Zentis, P., Kandpal, N., Kunis, S., Zobel, T., Weidtkamp-Peters, S., & Ferrando-May, E. (2023). I3D:bio's OMERO training material: Re-usable, adjustable, multi-purpose slides for local user training. Zenodo. https://doi.org/10.5281/zenodo.8323588",
        "Schrader, A. (2024). andreaschrader/doi-exercise (1.5.1). Zenodo. https://doi.org/10.5281/zenodo.10475430",
        "Sefton, P., Ó Carragáin, E., Soiland-Reyes, S., Corcho, O., Garijo, D., Palma, R., Coppens, F., Goble, C., Fernández, J. M., Chard, K., Gomez-Perez, J. M., Crusoe, M. R., Eguinoa, I., Juty, N., Holmes, K., Clark, J. A., Capella-Gutierrez, S., Gray, A. J. G., Owen, S., Williams, A. R., Tartari, G., Bacall, F., Thelen, T., Ménager, H., Rodríguez-Navas, L., Walk, P., Whitehead, B., Wilkinson, M., Groth, P., Bremer, E., Castro, L. J., Sebby, K., Kanitz, A., Trisovic, A., Kennedy, G., Graves, M., Koehorst, J., Leo, S., Portier, M., Brack, P., Ojsteršek, M., Droesbeke, B., Niu, C., Kosuke, T., Tomasz, M., La Rosa, M., Decruw, C., Czerniak, A., Jay, J., Serra, S., Siebes, R., de Witt, S., El Damaty, S., Lowe, D., Li, X., Gundersen, S. & Radifar, M. (2023). RO-Crate Metadata Specification 1.1.3 (1.1.3). Zenodo. https://doi.org/10.5281/zenodo.7867028",
        "Spaaks, J. H., Klaver, T., Verhoeven, S., Druskat, S., & Leoncio Netto, W. (2021). cffconvert (2.0.0). Zenodo. https://doi.org/10.5281/zenodo.5521767. Accessed 03. Jan. 2024",
        "Weil, H. L. & ARC Commander contributors. (2023). ARC Commander (GitHub repository). Available: https://github.com/nfdi4plants/arcCommander",
        "Wilkinson, M., Dumontier, M., Aalbersberg, I., Appleton, G., Axton, M., Baak, A., Blomberg, N., Boiten, J.-W., da Silva Santos, L. B., Bourne, P. E., Bouwman, J., Brookes, A. J., Clark, T., Crosas, M., Dillo, I., Dumon, O., Edmunds, S., Evelo,, C. T., Finkers, R., Gonzalez-Beltran, A., Gray, A. J. G., Groth, P., Goble, C., Grethe, J. S., Heringa, J., 't Hoen, P. A. C., Hooft, R., Kuhn, T., Kok, R., Kok, J., Lusher, S. J., Martone, M. E., Mons, A., Packer, A. L., Persson, B., Rocca-Serra, P., Roos, M., van Schaik, R., Sansone, S.-A., Schultes, E., Sengstag, T., Slater, T., Strawn, G., Swertz, M. A., Thompson, M, van der Lei, J., van Mulligen, E., Velterop, J., Waagmeester, A., Wittenburg, P., Wolstencroft, K., Zhao, J. & Mons, B. (2016) The FAIR Guiding Principles for scientific data management and stewardship. Scientific Data 3, 160018. https://doi.org/10.1038/sdata.2016.18",
        "Xiang Z, Mungall C, Ruttenberg A, He Y. (2011). Ontobee: A Linked Data Server and Browser for Ontology Terms. Proceedings of the 2nd International Conference on Biomedical Ontologies (ICBO), July 28-30, 2011, Buffalo, NY, USA. Pages 279-281. http://ceur-ws.org/Vol-833/paper48.pdf. Accessed 2023."
    ],
    "resource_type": "other",
    "title": "NFDI4Bioimage - TA3-Hackathon - UoC-2023 (Cologne-Hackathon-2023, GitHub repository)",
    "upload_type": "other",
    "version": "v0.9.12"
}
